/*
 * Maximus Version 3.02
 * Copyright 1989, 2002 by Lanius Corporation.  All rights reserved.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
 */

/*# name=ARC/PAK/ZIP/LZH structure definitions
*/

#include "typedefs.h"

/****************************************************************************/
/*************************** .ARJ information *******************************/
/****************************************************************************/

struct _arj_id
{
  #define ARJ_ID    0xea60u

  word id;
  word hdr_size;
};

struct _arj_hdr
{
  byte hdr_size;
  byte arj_ver;

  byte ver_to_extract;
  byte host_os;

  byte arj_flags;
  byte method;

  byte filetype;
  byte rsvd;

  union stamp_combo mod_date;
  dword comp_size;
  dword orig_size;
  dword file_crc;
  word entry_pos;
  word access_mode;
  word host_data;

  /* extra data */
  /* filename */
  /* comment */
  /* dword hdr_crc; */
  /* word exthdr_size; */
  /* byte exthdr[n]; */
  /* compressed file */
};

/****************************************************************************/
/*************************** .LZH information *******************************/
/****************************************************************************/

struct _lhpre
{
  byte hdrsize;
  byte sum;
};


struct _lh0
{
  byte  method[5];
  dword compressed_size;    /* packed */
  dword uncompressed_size;  /* original */
  union stamp_combo date;
  byte  attr;               /* attr */
  byte  hdr_ver;            /* level */
  byte  namelen;
};

struct _lh2
{
/*  5 */  byte  method[5];
/*  7 */  dword compressed_size;
/* 11 */  dword uncompressed_size;
/* 15 */  time_t date;
/* 19 */  byte  attr;
/* 20 */  byte  hdr_ver;
/* 21 */  word  crc;
/*-----------------------*/
/* 23 */  byte  hdrdos;   /* HDRdos */
/* 24 */  word  ext_size; /* HDRextsize */
};


/****************************************************************************/
/*************************** .ARC information *******************************/
/****************************************************************************/

struct _archead
{
  byte  sigbyte;            /* eof signature byte                */
  byte  method;             /* method of storage                 */
  byte  name[13];           /* name of file                      */
  dword compressed_size;    /* size compressed                   */
  word  date;               /* file date                         */
  word  time;               /* file time                         */
  word  crc;                /* crc check for data integrity      */
  dword uncompressed_size;  /* length of original file           */
};


/****************************************************************************/
